Revit 2024 API
ParameterFilterRuleFactory.CreateEqualsRule Method (ElementId, ElementId)
 Creates a filter rule that determines whether ElementId values from the document equal a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static FilterRule CreateEqualsRule(
	ElementId parameter,
	ElementId value
)
Visual Basic
Public Shared Function CreateEqualsRule ( _
	parameter As ElementId, _
	value As ElementId _
) As FilterRule
Visual C++
public:
static FilterRule^ CreateEqualsRule(
	ElementId^ parameter,
	ElementId^ value
)
Parameters
parameter
Type: Autodesk.Revit.DB.ElementId
 An ElementId-typed parameter used to get values from the document for a given element.
value
Type: Autodesk.Revit.DB.ElementId
 The user-supplied value against which values from the document will be compared.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ParameterFilterRuleFactory Class
CreateEqualsRule Overload
Autodesk.Revit.DB Namespace